Repository: HathorNetwork/hathor-wallet
Catalog: locale/*/texts.po
Languages: pt_br

source: I want to reset my wallet
pt_br: Eu quero resetar minha wallet

source: To set a blank passphrase mark the corresponding checkbox above.
pt_br: Marque acima para deixar a frase secreta em branco.

source: Passphrase and confirm passphrase must be equal
pt_br: A frase secreta e sua confirmação devem ser iguais

source: Invalid password
pt_br: Senha inválida

source: Invalid PIN
pt_br: PIN inválido

source: Are you sure you want to change your whole wallet setting this passphrase?
pt_br: Você tem certeza que deseja definir uma frase secreta?

source: I understand the risks of adding a passphrase.
pt_br: Eu entendo os riscos de adicionar uma frase secreta.

source: I want to set a blank passphrase.
pt_br: Eu quero usar uma frase secreta vazia.

source: Please, enter your password and PIN to confirm the operation.
pt_br: Por favor, entre sua senha e seu PIN para confirmar a operação

source: Password
pt_br: Senha

source: Set Passphrase
pt_br: Defina uma frase secreta

source: Adding a passphrase is an advanced feature, and you should not use it unless you know what you are doing.
pt_br: Adicionar uma frase secreta é uma operação avançada e você não deveria usá-la a não serque entenda o que está fazendo.

source: It will change all your addresses, so it is like generating a completely new wallet.
pt_br: Essa operação irá alterar todos os seus endereços. É como se você estivesse gerando uma wallet completamente nova.

source: You should take note of your passphrase for future use. If you lose your passphrase, you will never have access to your tokens again.
pt_br: Você deve anotar sua frase secreta para uso futuro. Se você perder sua frase secreta, você não terá mais acesso aos seus tokens.

source: Continue
pt_br: Continuar

source: Confirm
pt_br: Confirmar

source: Set a passphrase
pt_br: Definir uma frase secreta

source: Must choose an address or auto select
pt_br: Você deve escolher um endereço ou escolher seleção automática

source: Maximum value to mint token is ${ max_output_value_str }
pt_br: O maior valor para criar novos tokens é ${ max_output_value_str }

source: Please, wait while we create your token
pt_br: Por favor, aguarde enquanto seu token é criado

source: Your token has been successfully created!
pt_br: Seu token foi criado com sucesso!

source: You can share the following configuration string with other people to let them use your brand new token.
pt_br: Você deve compartilhar a seguinte configuração com outras pessoas para que elas consigam usar o seu token.

source: Remember to <strong>make a backup</strong> of this configuration string.
pt_br: Lembre-se de <strong>fazer o backup</strong> dessa configuração.

source: Here you will create a new customized token. After the creation, you will be able to send this new token to other addresses.
pt_br: Aqui você irá criar seu próprio token. Depois de criado, você conseguirá enviar seus novo token para outros endereços.

source: Custom tokens share the address space with all other tokens, including HTR. This means that you can send and receive tokens using any valid address.
pt_br: Os tokens compartilham os mesmos endereços, inclusive com o HTR. Isso significa que você pode enviar ou receber tokens usando qualquer endereço.

source: Remember to make a backup of your new token's configuration string. You will need to send it to other people to allow them to use your new token.
pt_br: Lembre-se de fazer o backup da configuração do seu novo token. Você irá precisar mandar essa configuração para que outras pessoas também consigam usar o seu token.

source: Short name
pt_br: Nome curto

source: MyCoin
pt_br: MeuToken

source: Symbol
pt_br: Símbolo

source: MYC (max 5 characters)
pt_br: MEU (máximo 5 caracteres)

source: Amount
pt_br: Quantidade

source: Select address automatically
pt_br: Selecionar um endereço automaticamente

source: Destination address
pt_br: Endereço de destino

source: Address
pt_br: Endereço

source: Token ${ _this.state.name } created
pt_br: O token ${ _this.state.name } foi criado

source: Custom Tokens
pt_br: Tokens

source: You can create your own digital token with customized specifications on Hathor Network with only a few clicks. They will fully work under the same technical assumptions of high scalability and decentralized consensus of our native HTR tokens. Custom tokens will always work independently of the price of the native HTR token, and they can serve multiple purposes.
pt_br: Você pode criar seus próprios tokens digitais na Hathor Network com apenas alguns cliques. Eles irão possuir as mesmas características técnicas de alta escalabilidade e consenso descentralizado dos tokens nativos HTR. O seu token será independente do token nativo HTR e não haverá relação de preço entre eles.

source: Every custom token has a unique <strong>Configuration String</strong> which must be shared with all other people that will use the custom token.
pt_br: Todo token possuí uma <strong>Configuração</strong> que é única e deve ser enviada para todas as pessoas que irão utilizar esse token.

source: If you want to use a custom token that already exists, you need to register this token in your Hathor Wallet. For this, you will need the custom token's Configuration String, which you can get from the creators of the token.
pt_br: Se você quiser usar um token que já existe, você deve registrá-lo na sua Hathor Wallet. Para isso, você irá precisar da Configuração desse token, a qual será fornecida pelo criador do token.

source: Create a new token
pt_br: Criar um novo token

source: Register a token
pt_br: Registrar um token

source: Token registered with success!
pt_br: Token registrado com sucesso!

source: Blocks |fn:(See all blocks)|
pt_br: Blocos |fn:(Ver todos)|

source: Transactions |fn:(See all transactions)|
pt_br: Transações |fn:(Ver todas)|

source: Here you can see the most recent transactions and blocks of the network.
pt_br: Aqui você pode visualizar os blocos e transações mais recentes da rede.

source: Timestamp
pt_br: Data e Hora

source: Decode tx
pt_br: Decodificar transação

source: push
pt_br: forçar

source: Write your transaction in hex value and click the button to get a human value description
pt_br: Escreva sua transação em hexadecimal e clique no botão para obter os detalhes

source: Could not decode this data to a transaction
pt_br: Não foi possível decodificar os dados dessa transação

source: Write the 24 words of your wallet (separated by space).
pt_br: Escreva as 24 palavras da sua wallet (separadas por espaço).

source: Words separated by single space
pt_br: Palavras separadas por um espaço

source: Back
pt_br: Voltar

source: Import data
pt_br: Importar wallet

source: Loading transactions...
pt_br: Carregando transações...

source: Please wait while we load the transactions of all your addresses.
pt_br: Por favor, aguarde enquanto nós carregamos as suas transações.

source: You will be automatically redirected to the wallet when we finish loading them.
pt_br: Você será automaticamente redirecionado para a wallet quando terminar.

source: <strong>Addresses found:</strong> ${ this.props.addressesFound }
pt_br: <strong>Endereços encontrados:</strong> ${ this.props.addressesFound }

source: <strong>Transactions found:</strong> ${ this.props.transactionsFound }
pt_br: <strong>Transações encontradas:</strong> ${ this.props.transactionsFound }

source: Your wallet is locked. Please write down your PIN to unlock it.
pt_br: Sua wallet está bloqueada. Por favor, entre com o seu PIN para desbloqueá-la.

source: Reset all data
pt_br: Resetar todos os dados

source: Unlock
pt_br: Desbloquear

source: . A new wallet is generated by 24 words.
pt_br: . Uma nova wallet é gerada a partir de 24 palavras.

source: . To have access to this wallet you must have all the words saved in the same order we will show to you.
pt_br: . Para recuperar o acesso a sua wallet, você deve salvar essas 24 palavras na mesma ordem que nós iremos te mostrar.

source: . If someone manages to discover your words they can steal your tokens, so we advise you to save your words physically and don't show them to anyone.
pt_br: . Se alguém tiver acesso as suas palavras, seus tokens podem ser roubados. Por isso, nós recomendamos que você salve suas palavras e não as mostre pra ninguém.

source: Ok, I got it!
pt_br: Ok, eu entendi!

source: Create my words
pt_br: Criar minhas palavras

source: Your words have been created!
pt_br: Suas palavras foram criadas com sucesso!

source: You should save them in a non-digital media, such as a piece of paper. We advise you to do it now, but you can do it later.
pt_br: You deve salvá-las em uma mídia não digital, como um pedaço de papel. Nós recomendamos que você faça isso agora, mas você pode fazer depois se desejar.

source: Do it later
pt_br: Fazer depois

source: Backup now
pt_br: Fazer o backup agora

source: Backup completed!
pt_br: Backup completo!

source: Page not found
pt_br: Página não encontrada

source: You tried to access a page that does not exist in Hathor Wallet
pt_br: Você tentou acessar uma página que não existe na Hathor Wallet

source: Force push
pt_br: Forçar o envio

source: Push tx
pt_br: Enviar transação

source: decode
pt_br: decodificar

source: Write your transaction in hex value and click the button to send it to the network. (We do not push blocks to the network, only transactions)
pt_br: Escreva sua transação em hexadecimal e clique no botão para enviá-la para a rede. (Não é possível enviar blocos, apenas transações)

source: Transaction pushed to the network with success!
pt_br: Transação enviada para a rede com sucesso!

source: All your tokens were already added
pt_br: Todos os seus tokens já foram adicionados

source: Add another token
pt_br: Adicionar outro token

source: Send Tokens
pt_br: Enviar Tokens

source: Please, wait while we solve the proof of work and propagate the transaction
pt_br: Por favor, aguarde enquanto nós resolvemos o PoW e propagamos sua transação

source: Automatic bug report
pt_br: Envio automático de relatórios de erros

source: We would like your permission to automatically report bugs to our development team. It really helps us to improve our Wallet faster for our community.
pt_br: Nós gostaríamos da sua permissão para automaticamente enviar relatórios de erros para nosso time de desenvolvimento. Isso irá nos ajudar a melhorar a Hathor Wallet mais rápido para toda a comunidade.

source: The report collects the following data:
pt_br: O relatório de erros irá coletar as seguintes informações:

source: The server your wallet is connected to;
pt_br: O servidor onde você está conectado;

source: The version of your wallet;
pt_br: A versão da sua Hathor Wallet;

source: The version of your operating system;
pt_br: A versão do seu sistema operacional;

source: The details of the bug, including the context it has happened.
pt_br: Os detalhes do erro, incluindo o contexto no qual ele aconteceu.

source: The report NEVER collects any sensitive data, such as your seed, your private keys, your addresses, or your balances.
pt_br: O relatório NUNCA irá coletar informações sensíveis, como as suas palavras, suas chaves privadas, seus endereços, ou seus saldos.

source: I allow Hathor Wallet to report error information to Hathor team.
pt_br: Eu autorizo a Hathor Wallet de enviar relatórios de erro para o time da Hathor.

source: Turn notifications off
pt_br: Desligar notificações

source: Are you sure you don't want to receive wallet notifications?
pt_br: Você tem certeza que não deseja receber notificações?

source: Turn notifications on
pt_br: Ligar notificações

source: Are you sure you want to receive wallet notifications?
pt_br: Você tem certeza que deseja receber notificações?

source: <strong>Server:</strong> You are connected to ${ serverURL }
pt_br: <strong>Servidor:</strong> Você está conectado à ${ serverURL }

source: Change server
pt_br: Mudar servidor

source: Advanced Settings
pt_br: Opções Avançadas

source: Allow notifications:
pt_br: Permitir notificações

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: Change
pt_br: Mudar

source: Automatically report bugs to Hathor:
pt_br: Enviar automaticamente relatórios de erro:

source: You can start a new wallet or import data from a wallet that already exists.
pt_br: Você pode criar uma nova wallet ou importar os dados de uma wallet que já possui.

source: New wallet
pt_br: Nova wallet

source: Import wallet
pt_br: Importar wallet

source: Transaction with hash ${ _this3.props.match.params.id } not found
pt_br: Transação com hash ${ _this3.props.match.params.id } não encontrada

source: Your API backend version is not compatible with this admin. We expect at least version
pt_br: A versão da API do servidor não é compatível com essa wallet. Você deve usar pelo menos a versão

source: Please update you API version and try again
pt_br: Por favor, atualize a API do seu servidor e tente novamente

source: Try again
pt_br: Tentar novamente

source: Change Server
pt_br: Mudar servidor

source: You haven't done the backup of your wallet yet. You should do it as soon as possible for your own safety.
pt_br: Você ainda não fez o backup da sua wallet. Você deveria fazer o mais rápido possível para sua própria segurança.

source: Do it now
pt_br: Fazer agora

source: Administrative Tools
pt_br: Ferramentas Administrativas

source: Balance & History
pt_br: Saldo & Histórico

source: About ${ token.name }
pt_br: Sobre ${ token.name }

source: Are you sure you want to unregister the token <strong>${ token.name } (${ token.symbol })</strong>?
pt_br: Você tem certeza que deseja desregistrar o token <strong>${ token.name } (${ token.symbol })</strong>?

source: You won't lose your tokens, you just won't see this token on the side bar anymore.
pt_br: Você não irá perder seus tokens. Eles apenas não irão aparecer mais nessa Hathor Wallet.

source: Unregister token
pt_br: Desregistrar token

source: You've recently updated your wallet, and this new version is not compatible with your local data.
pt_br: Você recentemente atualizou sua wallet e essa nova versão não é compatível com a anterior.

source: You have two alternatives:
pt_br: Você tem duas opções:

source: Use this new wallet version. In this case, you must reset and import your wallet again.
pt_br: Usar essa nova versão. Nesse caso, você deve resetar e importar sua wallet novamente.

source: Go back to the previous installed version.
pt_br: Usar a versão anterior.

source: If you are going to reset your wallet, please double-check your backup before doing so.
pt_br: Se você for resetar sua wallet, por favor verifique seu backup antes.

source: Backup Words
pt_br: Backup das Palavras

source: Reset Wallet
pt_br: Resetar Wallet

source: Backup done with success!
pt_br: Backup feito com sucesso!

source: Welcome to Hathor Wallet!
pt_br: Bem vindo à Hathor Wallet!

source: This wallet is connected to the
pt_br: Esta wallet está conectada à

source: Using this wallet you can (i) check your balance and history, (ii) send & receive HTR and other tokens running on Hathor, and (iii) create and manage your own tokens.
pt_br: Essa wallet te permite (i) verificar seu saldo e histórico, (ii) enviar e receber HTR e outros tokens que rodam na Hathor, e (iii) criar e gerenciar seus próprios tokens.

source: You should never share any information besides your addresses to other people. You're fully responsible for keeping your tokens safe.
pt_br: Você nunca deve compartilhar qualquer informação exceto seus endereços com outras pessoas. Você é o único responsável por guardar seus tokens com segurança.

source: For further information, check our website (https://hathor.network/).
pt_br: Para mais informação, veja nosso website (https://hathor.network/).

source: I understand that I am fully responsible for keeping my tokens safe and that it is not possible to revert transactions after they are executed.
pt_br: Eu entendo que sou totalmente responsável por guardar meus tokens de forma segura e que não é possível reverter uma transação depois que ela foi executada.

source: Get started
pt_br: Iniciar

source: Please, choose a password to encrypt your sensitive data while using the wallet.
pt_br: Por favor, escolha uma senha para criptografar seus dados privados.

source: Your password must have at least 8 characters and at least one lower case character, one upper case character, one number, and one special character.
pt_br: Sua senha deve ter pelo menos 8 caracteres e pelo menos uma letra minúscula, uma letra maiúscula, um número e um caracter especial.

source: Next
pt_br: Próximo

source: The PIN is a 6-digit password requested to authorize actions in your wallet, such as generating new addresses and sending tokens.
pt_br: O PIN é uma seqüência de 6 dígitos que será usada para autorizar operações na sua wallet, como a geração de novos endereços e o envio de tokens.

source: Must provide configuration string
pt_br: Você deve entrar com a configuração

source: Register Custom Tokens
pt_br: Registrar Tokens

source: You can register one or more tokens writing the configuration string of each one below.
pt_br: Você pode registrar um ou mais tokens escrevendo suas configurações abaixo.

source: Configuration strings
pt_br: Configuração

source: Cancel
pt_br: Cancelar

source: Register
pt_br: Registrar

source: Must provide configuration string or uid, name, and symbol
pt_br: Você deve entrar com a configuração ou com o uid, nome e símbolo

source: Register a new token
pt_br: Registrar um novo token

source: To register a token that already exists, just write down its configuration string
pt_br: Para registrar um token que já existe, apenas escreva sua configuração abaixo

source: Configuration string
pt_br: Configuração

source: Address copied to clipboard!
pt_br: Endereço copiado!

source: Address to receive tokens
pt_br: Endereço para receber tokens

source: Copy to clipboard
pt_br: Copiar

source: Close
pt_br: Fechar

source: Invalid number of words
pt_br: Quantidade de palavras inválida

source: Invalid sequence of words
pt_br: Ordem das palavras inválida

source: We need your password to show the words
pt_br: Entre com sua senha para ter acesso as suas palavras

source: Password*
pt_br: Senha*

source: Go
pt_br: Ir

source: Save the words and never share them. Anyone who has access to them will control your tokens.
pt_br: Salve suas palavras e nunca mostre-as a ninguém. Qualquer pessoa com acesso a elas terá controle sobre seus tokens.

source: Ok, I have saved them
pt_br: Ok, eu as salvei

source: Please, select the words below in the correct order. This is for your safety and to ensure you wrote them down correctly.
pt_br: Por favor, selecione as palavras na ordem correta. Essa etapa é para sua segurança, garantindo que você anotou as palavras na ordem certa.

source: Validate
pt_br: Validar

source: Save
pt_br: Salvar

source: You must write your password or check that you have forgotten it
pt_br: Você deve escrever sua senha ou marcar que você a esqueceu

source: Confirm message does not match
pt_br: Mensagem de confirmação inválida

source: If you reset your wallet, all data will be deleted, and you will lose access to your tokens. To recover access to your tokens, you will need to import your words again.
pt_br: Se você resetar sua wallet, todos os dados serão deletados e você irá perder acesso aos seus tokens. Para recuperar o acesso, você deverá importar suas palavras novamente.

source: ${ firstMessage } You still haven't done the backup of your words.
pt_br: ${ firstMessage } Você ainda não faz backup das suas palavras.

source: If you still wanna do it, we need your password and for you to write down <strong>'${ CONFIRM_RESET_MESSAGE }'</strong> to confirm the operation.
pt_br: Se você ainda deseja fazer isso, nós precisamos que você digite sua senha e também digite <strong>'${ CONFIRM_RESET_MESSAGE }'</strong> para confirmar a operação.

source: Confirm message*
pt_br: Mensagem de confirmação*

source: Write '${ CONFIRM_RESET_MESSAGE }'
pt_br: Escreva '${ CONFIRM_RESET_MESSAGE }'

source: I forgot my password
pt_br: Eu esqueci minha senha

source: Report sent to Hathor Team! Thanks for the support!
pt_br: Relatório enviado para o time da Hathor! Obrigado pela ajuda.

source: Error Message: ${ message } Stack trace: ${ stack }
pt_br: Mensagem de Erro: ${ message } Stack trace: ${ stack }

source: Ooops... Something went wrong...
pt_br: Ooops... Algo deu errado...

source: An unhandled exception occurred in your wallet.
pt_br: Ocorreu um erro não esperado na sua wallet.

source: If you'd like to help us improve it, please click in the button bellow to copy the error details to your clipboard.
pt_br: Se você puder nos ajudar a melhorar a wallet, por favor clique no botão abaixo para copiar os detalhes do erro.

source: Copy Error
pt_br: Copiar Erro

source: Send error report to help the developers
pt_br: Enviar o relatório de erros para ajudar os desenvolvedores

source: Send it to us with all relevant information about the issues you are experiencing.
pt_br: Envie para nós todas as informações relevantes sobre o problema que está ocorrendo.

source: If you are facing recurrent issues, resetting your wallet may solve your problem. Please, double-check your backup before doing it.
pt_br: Se você está tendo problemas recorrentes, você pode resetar sua wallet para ver se resolve. Por favor, confira o seu backup antes de resetá-la.

source: Home
pt_br: Início

source: Dismiss
pt_br: Descartar

source: Reset wallet
pt_br: Resetar wallet

source: Unregistered token
pt_br: Token desregistrado

source: This token is <strong>not registered</strong> in your wallet. You must <strong>always validate the token uid</strong>, to ensure you are not being scammed.
pt_br: Esse token <strong>não está registrado</strong> na sua wallet. Você deve <strong>sempre validar o uid to token</strong>, para ter certeza que não está sendo enganado.

source: The token uid is always unique, and your only trust point.
pt_br: O uid do token é sempre único e a única informação que você deve confiar.

source: I want to register this token
pt_br: Eu quero registrar esse token

source: Register token
pt_br: Registrar um token

source: Send tokens
pt_br: Enviar tokens

source: Custom tokens
pt_br: Tokens

source: Transactions
pt_br: Transações

source: Decode Tx
pt_br: Decodificar Transação

source: Push Tx
pt_br: Forçar Transação

source: Time lock
pt_br: Bloqueio por data

source: Date and time in GMT
pt_br: Data e hora em GMT

source: Both fields must be equal
pt_br: Ambos os campos devem ser iguais

source: Find transaction/block by hash or address
pt_br: Procurar transação/bloco por hash ou endereço

source: Invalid address and hash format
pt_br: Endereço ou hash inválido

source: Remove
pt_br: Remover

source: Choose inputs automatically
pt_br: Selecionar as entradas automaticamente

source: Inputs
pt_br: Entradas

source: Online
pt_br: Conectado

source: Offline
pt_br: Desconectado

source: Lock wallet
pt_br: Bloquear wallet

source: Settings
pt_br: Opções

source: Previous
pt_br: Anterior

source: Date
pt_br: Data

source: Type
pt_br: Tipo

source: Value
pt_br: Valor

source: Voided
pt_br: Nulo

source: Token creation
pt_br: Criação de token

source: Received
pt_br: Recebido

source: Token deposit
pt_br: Depósito para token

source: Sent
pt_br: Enviado

source: You are receiving transactions in real time.
pt_br: Você está visualizando em tempo real.

source: Page ${ page }
pt_br: Página ${ page }

source: Mint authority
pt_br: Autoridade de Criação

source: Melt authority
pt_br: Autoridade de Destruição

source: Unknown authority
pt_br: Authority desconhecida

source: This token is not registered in your wallet.
pt_br: Este token não está registrado na sua wallet.
