Repository: HathorNetwork/hathor-wallet
Catalog: locale/*/texts.po
Languages: pt_br

source: ${ output.script } (unknown script)
pt_br: ${ output.script } (script desconhecido)

source: Spent
pt_br: Gasto

source: ${ ret } | Locked until ${ parsedTimestamp }
pt_br: ${ ret } | Bloqueado até ${ parsedTimestamp }

source: Although there is a double-spending transaction, this transaction has the highest accumulated weight and is valid.
pt_br: Apesar de ter uma transação em conflito, esse transação tem o maior peso acumulado e é válida.

source: Transactions double spending the same outputs as this transaction:
pt_br: Transações em conflito com essa transação:

source: Over ${ acc }
pt_br: Acima de ${ acc }

source: Retrieving accumulated weight data...
pt_br: Carregando peso acumulado...

source: Your address
pt_br: Seu Endereço

source: Balance:
pt_br: Saldo:

source: First block:
pt_br: Primeiro bloco:

source: Accumulated weight:
pt_br: Peso acumulado:

source: Confirmation level:
pt_br: Nível de confirmação:

source: Block
pt_br: Bloco

source: Transaction
pt_br: Transação

source: Type:
pt_br: Tipo:

source: Time:
pt_br: Horário:

source: Weight:
pt_br: Peso:

source: Inputs:
pt_br: Entradas:

source: Outputs:
pt_br: Saídas:

source: Parents:
pt_br: Pais:

source: Children:
pt_br: Filhos:

source: Click to hide
pt_br: Clique para esconder

source: Click to show
pt_br: Clique para mostrar

source: Verification neighbors
pt_br: Vizinhança de Verificação

source: Funds neighbors
pt_br: Vizinhaça de Fundos

source: Hide raw transaction
pt_br: Esconder código da transação

source: Show raw transaction
pt_br: Mostrar código da transação

source: Copy raw tx to clipboard
pt_br: Copiar código da transação

source: Copied to clipboard!
pt_br: Copiado!

source: Click |link:here| to ${ props.otherAction } this transaction
pt_br: Click |link:aqui| para ${ props.otherAction } uma transação

source: Version
pt_br: Versão

source: Generate new address
pt_br: Gerar novo endereço

source: Get new address
pt_br: Gerar novo endereço

source: Get qrcode
pt_br: Baixar QR Code

source: You must use an old address before generating new ones
pt_br: Você deve usar esse endereço antes de gerar um novo

source: Available:
pt_br: Disponível:

source: Locked:
pt_br: Bloqueado:

source: Transaction history
pt_br: Histórico de transações

source: Mint
pt_br: Criar

source: Melt
pt_br: Destruir

source: ${ type } output delegated!
pt_br: ${ type } output delegado!

source: mint
pt_br: criar

source: melt
pt_br: destruir

source: Address of the new ${ type } authority
pt_br: Endereço da nova autoridade de ${ type }

source: Create another ${ type } output for you?
pt_br: Criar outro ${ type } output para você?

source: Leave it checked unless you know what you are doing
pt_br: Deixe marcado a não ser que você saiba o que está fazendo

source: ${ label } outputs destroyed!
pt_br: ${ label } outputs destruídos!

source: Are you sure you want to destroy <strong>${ quantity } ${ type }</strong> authority ${ plural }?
pt_br: Você tem certeza que deseja destruir <strong>${ quantity } ${ type }</strong> authority ${ plural }?

source: Destroy
pt_br: Destruir

source: Can't find outputs to melt the amount requested.
pt_br: Não foi possível encontrar outputs para destruir a quantidade desejada.

source: ${ prettyAmountValue } ${ _this.props.token.symbol } melted!
pt_br: ${ prettyAmountValue } ${ _this.props.token.symbol } destruídos!

source: The total amount you have is only ${ prettyWalletAmount }.
pt_br: A quantidade total que você tem é de apenas ${ prettyWalletAmount }.

source: Create another melt output for you?
pt_br: Criar outro melt output para você?

source: Melt tokens
pt_br: Destuir tokens

source: ${ prettyAmountValue } ${ _this.props.token.symbol } minted!
pt_br: ${ prettyAmountValue } ${ _this.props.token.symbol } criados!

source: Address is required when not selected automatically
pt_br: Endereço é obrigatório quando não for selecionado automaticamente

source: Automatically select address to receive new tokens
pt_br: Automaticamente selecionar endereço para receber novos tokens

source: Create another mint output for you?
pt_br: Criar outro mint output para você?
